# -*- coding:utf-8 -*-

# Эта программа для обучения математическим операциям


# вывод предложения
print u"Я подсчитаю свою живность!"
# подсчет кур, петухов, яиц
print u"Куры", 25 + 30 / 6
print u"Петухи", 100-25 * 3 % 4
print u"А теперь подсчитаю яйца:"

# пробуем деление, сравнение
print 3 + 2 + 1-5 + 4 %  2-1 / 4 + 6
print u"Верно ли, что 3 + 2 < 5-7?"
print 3 + 2 < 5 - 7

# играемся как можем
print u"Сколько будет 3 + 2?", 3 + 2
print u"А сколько будет 5 - 7?", 5 - 7
print u"Ой, я кажется запутался. почему False?"

print u"Ещё раз посчитаю"

# контрольные испытания
print u"Это больше?", 5 > 2
print u"А это больше или равно?", 5 >= -2
print u"А это меньше или равно?", 5 <= -2

# моя формула
print u"2**2 + (6/2) - 4", 2**2 + (6.0 / 2.0) - 4

# tests
print u"7 / 4", 7 / 4
print u"7.0 / 4.0", 7.0 / 4.0
